app/controllers/admin/daywisemenus_controller.rb

INSERT INTO `daywisemenus` (`menuitem`, `day_id`) VALUES('palak paneer ', 1)
---
   def create

	@daywisemenu = Daywisemenu.new(params[:daywisemenu])
      if @daywisemenu.save

SELECT id FROM `daywisemenus` WHERE (id < 9) ORDER BY id DESC LIMIT 1
---
   def edit

	  @daywisemenu = Daywisemenu.find(params[:id])

SELECT * FROM `daywisemenus` WHERE (`daywisemenus`.`id` = 1)
---
   def update
	      @daywisemenu = Daywisemenu.find(params[:id])