app/controllers/daywisemenu_controller.rb

   def show
	   @daywisemenu = Daywisemenu.find(params[:id])
---
SELECT * FROM `daywisemenus` WHERE (`daywisemenus`.`id` = 1)

   def create

	@daywisemenu = Daywisemenu.new(params[:daywisemenu])
      if @daywisemenu.save
---
INSERT INTO `daywisemenus` (`menuitem`, `day_id`) VALUES('Dosa', 1)

   def edit

	  @daywisemenu = Daywisemenu.find(params[:id])
---
SELECT * FROM `daywisemenus` WHERE (`daywisemenus`.`id` = 1)

   def delete
	Daywisemenu.find(params[:id]).destroy
---
DELETE FROM `daywisemenus` WHERE `id` = 2
SELECT * FROM `daywisemenus` WHERE (`daywisemenus`.`id` = 2)