app/controllers/menudisplay_controller.rb

  def show
	  puts "--------------------- in show -----------------"
	 # puts params[:daywisemenu][:day_id]
	 if params[:daywisemenu][:day_id]!= nil
	@daywisemenu = Daywisemenu.find(:all,
							    :conditions => ["day_id = #{params[:daywisemenu][:day_id]}" ]).each do |a|
---
SELECT * FROM `daywisemenus` WHERE (day_id = '5')