app/controllers/users_controller.rb

INSERT INTO `users` (`created_at`, `crypted_password`, `updated_at`, `username`, `password_salt`, `persistence_token`, `email`) VALUES('2010-12-09 06:46:36', '88d6ed75ed9f64374e234fa064a7426231424160e1984980bec7138670e0038445c4e0229c7feb0a9dd37dca3f45257498be3a6d65dffced9eca361e14a33258', '2010-12-09 06:46:36', 'rahul', 'VZEYuR6TsyYbE8KCbEOQ', 'e7ac082ecef7ba60846289ae7b3605d19a06b5b562f14cf93e10d215013dfdab2e27b84edc4e9c90d847013e929269b79ead821e4841ba4c7510743d1b1d1be9', 'rahul@innozon.com')
---
    def create
      @user = User.new(params[:user])
      if @user.save

UPDATE `users` SET `updated_at` = '2010-12-09 07:28:58', `crypted_password` = 'f1c1ae3f55deda35b8674c860278850e77d6fc997fd30c397860eaff776a43bab7140f5737696bff2d3dc39f30f24caf4aae227e8df0c455d92422cc897b69a0', `password_salt` = '3EgFhUK0EjAH4KiLFtny', `persistence_token` = '05b13d088c81433e6fed3e3c7da0d821c8895e4ce705e636986d0ca94a325dfb395e577f6a244d03f92666dd85aeeb903d22629519d4424f148c39c10dbabae4' WHERE `id` = 1
---
 def update
   @user = current_user
   if @user.update_attributes(params[:user])